init.org
#+TITLE: Emacs configuration file
#+AUTHOR: Pierce Wang
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes :results silent
#+STARTUP: content indent
* Credits
Inspired by [[https://github.com/freetonik/emacs-dotfiles][freetonik]]'s setup. Check out his podcast!
* Installing
This config works best with brew's emacs (26.1)
#+begin_src sh :tangle no
  brew cask install emacs
#+end_src

** Dependencies
#+begin_src sh :tangle no
  brew install ispell
  brew cask install mactex
#+end_src

** Meta
When this configuration is loaded for the first time, the =init.el= is the file that is loaded. It looks like this:

#+BEGIN_SRC emacs-lisp :tangle no
  ;; This file replaces itself with the actual configuration at first run.

  ;; We can't tangle without org!
  (require 'org)
  ;; Open the configuration
  (find-file (concat user-emacs-directory "init.org"))
  ;; tangle it
  (org-babel-tangle)
  ;; load it
  (load-file (concat user-emacs-directory "init.el"))
  ;; finally byte-compile it
  (byte-compile-file (concat user-emacs-directory "init.el"))
#+END_SRC

** Headers
Lexical scoping for the init-file is needed, it can be specified in the header. This is the first line of the actual configuration:

#+BEGIN_SRC emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+END_SRC

Tangle and compile this file on save automatically:

#+BEGIN_SRC emacs-lisp
  (defun tangle-init ()
    "If the current buffer is 'init.org' the code-blocks are
  tangled, and the tangled file is compiled."
    (when (equal (buffer-file-name)
                 (expand-file-name (concat user-emacs-directory "init.org")))
      ;; Avoid running hooks when tangling.
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file (concat user-emacs-directory "init.el")))))

  (add-hook 'after-save-hook 'tangle-init)
#+END_SRC

This helps get rid of =functions might not be defined at runtime= warnings. See https://github.com/jwiegley/use-package/issues/590

#+BEGIN_SRC emacs-lisp
  (eval-when-compile
    (defvar use-package-expand-minimally byte-compile-current-file))
#+END_SRC

* Startup
** Garbage Collection
For faster startup times, according to [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][hlissner]],

#+begin_quote
The GC eats up quite a bit of time, easily doubling startup time. The trick is to turn up the memory threshold as early as possible.
#+end_quote

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
        gc-cons-percentage 0.6)

  (defvar better-gc-cons-threshold 16777216 ; 16mb
    "The default value to use for `gc-cons-threshold'.
  If you experience freezing, decrease this. If you experience stuttering, increase this.")


  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq gc-cons-threshold better-gc-cons-threshold
            gc-cons-percentage 0.1))) ; Default value for `gc-cons-percentage'
#+end_src

gc and minibuffer (also from doom)
#+begin_src emacs-lisp
  (defun pgw/defer-garbage-collection-h ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun pgw/restore-garbage-collection-h ()
    "Defer it so that commands launched immediately after will enjoy the benefits."
    (run-at-time
     1 nil (lambda () (setq gc-cons-threshold better-gc-cons-threshold))))

  (add-hook 'minibuffer-setup-hook #'pgw/defer-garbage-collection-h)
  (add-hook 'minibuffer-exit-hook #'pgw/restore-garbage-collection-h)
#+end_src

** Package Setup
Initialize package and add Melpa, GNU, and Org sources.
#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives
      '(("melpa-stable" . "https://stable.melpa.org/packages/")
        ("gnu" . "https://elpa.gnu.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ))
  (package-initialize)
#+end_src

** Use package
Add custom load path:

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/custom_load/")
#+end_src

Install use-package.

#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile (require 'use-package))

  (setq use-package-always-ensure t)
#+END_SRC

use-package.el no longer needed at runtime
#+begin_src emacs-lisp
  (eval-when-compile
    (require 'use-package))
  (require 'bind-key)                ;; if you use any :bind variant
#+end_src

* Configurations
** Emacs Stuff
*** Startup Time Test

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (message "Emacs ready in %s with %d garbage collections."
		       (format "%.2f seconds"
			       (float-time
				(time-subtract after-init-time before-init-time)))
		       gcs-done)))
#+end_src

*** Custom Set Variables
Store custom-file separately, don't freek out when it's not found.
#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file 'noerror)
#+end_src

*** Confirm Kill Emacs
Make Emacs confirm when quitting:
#+begin_src emacs-lisp
  (setq confirm-kill-emacs 'yes-or-no-p)
#+end_src
** Custom Functions
*** append-to-list
#+begin_src emacs-lisp
  (defun append-to-list (list-var elements)
    "Append ELEMENTS to the end of LIST-VAR.

  The return value is the new value of LIST-VAR."
    (unless (consp elements)
      (error "ELEMENTS must be a list"))
    (let ((list (symbol-value list-var)))
      (if list
          (setcdr (last list) elements)
        (set list-var elements)))
    (symbol-value list-var))
#+end_src

*** Increment/Decrement Numbers
#+begin_src emacs-lisp
  ;;; Increment Numbers
  (defun increment-number-at-point ()
    "Increments numbers at cursor"
    (interactive)
    (skip-chars-backward "0-9")
    (or (looking-at "[0-9]+")
        (error "No number at point"))
    (replace-match (number-to-string (1+ (string-to-number (match-string 0))))))

  ;;; Decrement Numbers
  (defun decrement-number-at-point ()
    "Decrements numbers at cursor"
    (interactive)
    (skip-chars-backward "0-9")
    (or (looking-at "[0-9]+")
        (error "No number at point"))
    (replace-match (number-to-string (1- (string-to-number (match-string 0))))))

  ;;; Binding
  (global-set-key (kbd "C-; C-=") 'increment-number-at-point)
  (global-set-key (kbd "C-; C--") 'decrement-number-at-point)
#+end_src

*** Insert Directory (obsolete?)
#+begin_src emacs-lisp
  (defun insertdirectory ()
    "Insert current directory for macro use"
    (interactive)
    (insert default-directory))
#+end_src

*** Ignore Error Wrapping Function
For some functions that I don't need to give errors:
#+begin_src emacs-lisp
  (defun ignore-error-wrapper (fn)
    "Funtion return new function that ignore errors.
       The function wraps a function with `ignore-errors' macro."
    (lexical-let ((fn fn))
      (lambda ()
        (interactive)
        (ignore-errors
          (funcall fn)))))
#+end_src

*** Insert Org-mode Image
#+begin_src emacs-lisp
  (defun insert-org-image (&optional swindow)
    "Prompt user for name of file, append time and date string, then use the Mac OSX `screencapture` feature to take a photo and place it in the relative ./figures directory."
    (interactive "P")
    (unless (not (eq system-type 'darwin))
      (let* ((outdir (concat (file-name-directory (buffer-file-name)) "/figures"))
             (namefile (concat (read-string "Enter File Name: ") "_" (format-time-string "%Y%m%d_%H%M%S.jpeg"))))
        (if (char-equal (aref namefile 0) ?_)
            (setq namefile (substring namefile 1 (length namefile))))
        (let* ((outfile (expand-file-name namefile outdir)))
          (unless (file-directory-p outdir)
            (make-directory outdir t))
          (message "Argument: %s" swindow)
          (if swindow
              (call-process "screencapture" nil nil nil "-w" outfile)
            (call-process "screencapture" nil nil nil "-i" outfile))
          (message namefile)
          (insert (concat (concat "[[file:./figures/" (file-name-nondirectory outfile)) "]]"))))
      )
    )
#+end_src

*** Keyboard Coding System
#+begin_src emacs-lisp
  (set-keyboard-coding-system nil)
#+end_src

*** Dired Open File
#+begin_src emacs-lisp
  (defun pgw/dired-open-file ()
    "In dired, open the file named on this line using the default application in the system."
    (interactive)
    (let ((file (dired-get-filename nil t)) ; Full path
          (filename (dired-get-filename t t))) ; File name for display
      (message "Opening %s..." filename)
      (call-process "open" nil 0 nil file)
      (message "Opening %s done" filename)))
#+end_src

*** Copy MLA org-file
#+begin_src emacs-lisp
  (defun pgw/copy-mla-file ()
    "Copy MLA_OrgFile.org to current directory for use in school essays."
    (interactive)
    (copy-file "~/Dropbox/org/templates/school/MLA_OrgFile.org" default-directory)
    )
#+end_src

*** Lookup in Dictionary (Apple)
#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (defun pgw/lookup-dictionary ()
      "Function to open a dictionary searching the highlighted word
  No spaces are allowed in the input of this function"
      (interactive)
      (let ((word (read-from-minibuffer "Word query: ")))
        (call-process "open" nil nil nil (concat "dict://" word)))
      )
    (global-set-key (kbd "M-#") 'pgw/lookup-dictionary)
    )
#+end_src

** Modifier Keys
#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (with-no-warnings
      (setq mac-option-modifier 'meta)
      (setq mac-control-modifier 'control)
      (setq ns-function-modifier 'hyper)))

  (when (eq system-type 'gnu/linux)
    (with-no-warnings (setq x-super-keysym 'hyper)))
#+end_src

