init.org
*** Set default font and configure font resizing

Credit to Harry R. Schwartz [[https://github.com/hrs/dotfiles/blob/master/emacs/.emacs.d/configuration.org#set-default-font-and-configure-font-resizing][github]]

The standard =text-scale-= functions just resize the text in the current buffer; I’d generally like to resize the text in every buffer, and I usually want to change the size of the modeline, too (this is especially helpful when presenting). These functions and bindings let me resize everything all together!

Note that this overrides the default font-related keybindings from sensible-defaults.

#+begin_src emacs-lisp
  (setq pgw/default-font "Menlo")
  (setq pgw/default-font-size 12)
  (setq pgw/current-font-size pgw/default-font-size)

  (setq pgw/font-change-increment 1.1)

  (defun pgw/font-code ()
    "Return a string representing the current font (like \"Inconsolata-14\")."
    (concat pgw/default-font "-" (number-to-string pgw/current-font-size)))

  (defun pgw/set-font-size ()
    "Set the font to `pgw/default-font' at `pgw/current-font-size'.
  Set that for the current frame, and also make it the default for
  other, future frames."
    (interactive)
    (let ((font-code (pgw/font-code)))
      (if (assoc 'font default-frame-alist)
          (setcdr (assoc 'font default-frame-alist) font-code)
        (add-to-list 'default-frame-alist (cons 'font font-code)))
      (set-frame-font font-code)))

  (defun pgw/reset-font-size ()
    "Change font size back to `pgw/default-font-size'."
    (interactive)
    (setq pgw/current-font-size pgw/default-font-size)
    (pgw/set-font-size))

  (defun pgw/increase-font-size ()
    "Increase current font size by a factor of `pgw/font-change-increment'."
    (interactive)
    (setq pgw/current-font-size
          (ceiling (* pgw/current-font-size pgw/font-change-increment)))
    (pgw/set-font-size))

  (defun pgw/decrease-font-size ()
    "Decrease current font size by a factor of `pgw/font-change-increment', down to a minimum size of 1."
    (interactive)
    (setq pgw/current-font-size
          (max 1
               (floor (/ pgw/current-font-size pgw/font-change-increment))))
    (pgw/set-font-size))

  (define-key global-map (kbd "C-)") 'pgw/reset-font-size)
  (define-key global-map (kbd "C-H-0") 'pgw/set-font-size)
  (define-key global-map (kbd "C-+") 'pgw/increase-font-size)
  (define-key global-map (kbd "C-=") 'pgw/increase-font-size)
  (define-key global-map (kbd "C-_") 'pgw/decrease-font-size)
  (define-key global-map (kbd "C--") 'pgw/decrease-font-size)

  (add-hook 'emacs-startup-hook
            (lambda () (interactive) (pgw/reset-font-size)))
#+end_src

*** Variable Pitch Default Font
#+begin_src emacs-lisp
  (set-face-attribute 'variable-pitch nil :family "Avenir Next")
#+end_src

*** Mixed Pitch
Mixed pitch package for mixing variable and monospace fonts where appropriate (replacing buffer-face-mode).

I copied mixed-pitch.el from [[https://gitlab.com/jabranham/mixed-pitch/][this]] repository because of [[https://gitlab.com/jabranham/mixed-pitch/issues/6][this]] issue. I will hopefully be changing it back at some point (or coming up with a better fix because the fonts don't seem to work great together) but for now this will be the fix.

#+begin_src emacs-lisp
  (use-package mixed-pitch
    :load-path "custom_load"
    :config
    ;; (set-face-attribute 'variable-pitch :height 160)
    (setq mixed-pitch-fixed-pitch-faces '(diff-added diff-context diff-file-header diff-function diff-header diff-hunk-header diff-removed font-latex-math-face font-latex-sedate-face font-latex-warning-face font-latex-sectioning-5-face font-lock-builtin-face font-lock-comment-delimiter-face font-lock-constant-face font-lock-doc-face font-lock-function-name-face font-lock-keyword-face font-lock-negation-char-face font-lock-preprocessor-face font-lock-regexp-grouping-backslash font-lock-regexp-grouping-construct font-lock-string-face font-lock-type-face font-lock-variable-name-face markdown-code-face markdown-gfm-checkbox-face markdown-inline-code-face markdown-language-info-face markdown-language-keyword-face markdown-math-face message-header-name message-header-to message-header-cc message-header-newsgroups message-header-xheader message-header-subject message-header-other mu4e-header-key-face mu4e-header-value-face mu4e-link-face mu4e-contact-face mu4e-compose-separator-face mu4e-compose-header-face org-block org-block-begin-line org-block-end-line org-document-info-keyword org-code org-latex-and-related org-checkbox org-meta-line org-table org-verbatim))
    (append-to-list 'mixed-pitch-fixed-pitch-faces '(line-number line-number-current-line org-list-dt org-link))
    ;; (add-hook 'text-mode-hook 'mixed-pitch-mode)
    (global-set-key (kbd "C-x v f") 'mixed-pitch-mode)
    )
#+end_src

** GPG

#+begin_src emacs-lisp
  ;; (require 'epa-file)
  (epa-file-enable)
  (setf epa-pinentry-mode 'loopback)
#+end_src

** Passwords
#+begin_src emacs-lisp
  (load-file "~/.passwords.el")
#+end_src

** Mode Line

#+begin_src emacs-lisp
  (use-package smart-mode-line
    :config
    (setq rm-blacklist '(" hl-p" " WK" " yas" " Undo-Tree" " hs")
          sml/theme 'dark
          sml/name-width 30
          )
    (add-to-list 'sml/replacer-regexp-list '("^~/Google Drive/OHS/\\([0-9]\\{2\\}\\)th Grade/Classes/Semester [0-9]/\\([0-9A-Z]*\\)/" ":\\2:"))
    (add-hook 'after-init-hook 'sml/setup)
    )
#+end_src

*** Other Configuration
#+begin_src emacs-lisp
  (size-indication-mode 1)
  (line-number-mode -1)
#+end_src

*** Time display
#+begin_src emacs-lisp
  (setq display-time-format "%a %m/%d %H:%M")
  (display-time-mode)
#+end_src

*** Battery display
#+begin_src emacs-lisp
  (setq battery-mode-line-format " [%b%p%%]")
  (display-battery-mode)
#+end_src

** Helm
#+begin_src emacs-lisp
  (use-package helm
    :config
    (require 'helm-config)
    (helm-mode 1)
    (define-key global-map [remap find-file] 'helm-find-files)
    (define-key global-map [remap occur] 'helm-occur)
    (define-key global-map [remap list-buffers] 'helm-buffers-list)
    (define-key global-map [remap dabbrev-expand] 'helm-dabbrev)
    (define-key global-map [remap execute-extended-command] 'helm-M-x)
    (unless (boundp 'completion-in-region-function)
      (define-key lisp-interaction-mode-map [remap completion-at-point] 'helm-lisp-completion-at-point)
      (define-key emacs-lisp-mode-map       [remap completion-at-point] 'helm-lisp-completion-at-point))
    )
#+end_src

** Diary
*** Diary file
#+begin_src emacs-lisp
;(setq org-agenda-include-diary t)
(setq diary-file "~/Dropbox/org/diary")
#+end_src
*** Appointments Setup
#+begin_src emacs-lisp
(appt-activate 1)
(setq appt-message-warning-time 15)
(setq diary-comment-start "##")

#+end_src

** Org-mode

*** Setting orgmode directories:

#+begin_src emacs-lisp
  (setq org-directory "~/Dropbox/org")
  (setq org-default-notes-file (concat org-directory "/inbox.org"))
#+end_src

*** Startup Settings
Make org-mode files automatically indent.
#+begin_src emacs-lisp
  (setq org-startup-indented t)
#+end_src

*** Todo keywords

#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)" "DELEGATED(g)")))
#+end_src

*** Keybinds
#+begin_src emacs-lisp

(define-key global-map "\C-cc" 'org-capture)
  (global-set-key (kbd "H-c o") 
                  (lambda () (interactive) (find-file (concat org-directory "/school.org"))))
  (global-set-key (kbd "H-c p") 
                  (lambda () (interactive) (dired "~/Google Drive/OHS/11th Grade/Semester 2/")))
  (global-set-key (kbd "H-c i") 
                  (lambda () (interactive) (find-file (concat org-directory "/gtd.org"))))
  (global-set-key (kbd "H-c v") 
                  (lambda () (interactive) (find-file (concat org-directory "/violin.org"))))
  (global-set-key (kbd "H-c m") 
                  (lambda () (interactive) (find-file (concat org-directory "/notes.org"))))
  (global-set-key (kbd "H-c k") 
                  (lambda () (interactive) (find-file (concat org-directory "/links.org"))))

  ;;; Agenda key (C-c a) and other settings
  (global-set-key "\C-cl" 'org-store-link)
  (global-set-key "\C-ca" 'org-agenda)
  (global-set-key "\C-cc" 'org-capture)
  (global-set-key "\C-cb" 'org-switchb)

  (evil-define-key 'normal org-mode-map "<<" 'org-promote-subtree)
  (evil-define-key 'normal org-mode-map ">>" 'org-demote-subtree)
#+end_src

*** Tags
#+begin_src emacs-lisp
  (setq org-tag-persistent-alist '(("OHS" . ?S)
				   ("noexport" . ?N)))
#+end_src

*** Log when tasks are marked as done:
#+begin_src emacs-lisp
  (setq org-log-done 'time) ; Log when task marked as done
#+end_src

