init.org
*** Org Refile:
#+begin_src emacs-lisp
  (setq pgw/refile-targets (file-expand-wildcards "~/Dropbox/org/*.org"))
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9)
                             (pgw/refile-targets :maxlevel . 9)))
  (setq org-refile-use-outline-path 'file)
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
#+end_src

*** Agenda

#+begin_src emacs-lisp
  ;; org-agenda-auto-exclude-function
  (defun pgw/org-my-auto-exclude-function (tag)
    (if
        (string= tag "officehours")
        (concat "-" tag)))
  (setq org-agenda-auto-exclude-function 'pgw/org-my-auto-exclude-function)

  ;(setq org-agenda-overriding-columns-format "%28ITEM %TODO %SCHEDULED %DEADLINE %TAGS")

  ;; Re-align tags when window shape changes
  (add-hook 'org-agenda-mode-hook
            (lambda () (add-hook 'window-configuration-change-hook 'org-agenda-align-tags nil t)))

  ;(add-hook 'org-agenda-finalize-hook
  ;	  'org-agenda-align-tags)

  (setq org-deadline-warning-days 7)

  (add-hook 'org-agenda-finalize-hook
            (lambda ()
              (display-line-numbers-mode -1)
              ))

  ;; Org entries
  (setq org-agenda-max-entries nil)
#+end_src

**** CANCELLED Hydra for Filtering                               :ARCHIVE:
     CLOSED: [2019-10-08 Tue 20:17]
A hydra to quickly use different filter presets.
Presents:
- School-related items
- Class
- Violin

#+begin_src emacs-lisp :tangle no
   (defhydra pgw/org-agenda-filter-presets ()
     "A hydra to make filter presets for the org-agenda"
     ("S" (progn (org-agenda-filter-remove-all) (org-agenda-filter-apply '("+OHS") 'tag)) "OHS")
     ("o" (progn (org-agenda-filter-remove-all) (org-agenda-filter-apply '("-OHS") 'tag)) "Everything but OHS")
     ("n" (org-agenda-filter-remove-all) "Remove all")
     ("q" nil "exit" :exit t)
     )

   (define-key org-agenda-mode-map (kbd "H-/") 'pgw/org-agenda-filter-presets/body)
#+end_src

**** Custom Commands
Custom commands, testing sorting strategy variable

#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
        '(("q" . "Custom Agenda Views")
          ("A" "General Agenda" agenda ""
           ((org-agenda-span 1)
            (org-agenda-sorting-strategy
             '((agenda habit-down time-up deadline-up)))))
          )
        )
#+end_src

**** Files
#+begin_src emacs-lisp
  (setq org-agenda-files (append (file-expand-wildcards "~/Dropbox/org/*.org")
                                 (file-expand-wildcards "~/Dropbox/org/calendars/*.org")))
#+end_src

**** Time Grid Variable

#+begin_src emacs-lisp
  (setq org-agenda-time-grid '((daily today require-timed)
                               (600 700 800 900 1000 1100 1200 1300 1400 1500 1600 1700 1800 1900 2000 2100 2200 2300 2400)
                               "......" "----------------"))
#+end_src

*** CANCELLED org-super-agenda
    CLOSED: [2019-10-08 Tue 19:00]
Testing out org-super-agenda. Code kept here in case I want to experiemnt in the future. However, for now, I've decided that tags and filtering is the best option for me.
#+begin_src emacs-lisp :tangle no
  (use-package org-super-agenda
    :config
    (org-super-agenda-mode)
    )
  (setq org-agenda-custom-commands
        '(("z" "Super zaen view"
           ((agenda "" ((org-agenda-span 'day)
                        (org-super-agenda-groups
                         '((:name "Text"
                                  :time-grid t
                                  :date today
                                  :todo "TODO"
                                  :scheduled today
                                  :deadline today
                                  :order 1)
                           (:name "School Stuff"
                                  :tag "OHS"
                                  :order 2)
                           ))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:name "Due Today"
                                   :deadline today
                                   :order 2)
                            (:name "OHS"
                                   :tag "OHS"
                                   :order 10)
                            (:name "Due Soon"
                                   :deadline future
                                   :order 8)
                            (:name "Overdue"
                                   :deadline past
                                   :order 9)
                            (:name "Issues"
                                   :tag "Issue"
                                   :order 12)
                            (:name "Emacs"
                                   :tag "Emacs"
                                   :order 13)
                            (:name "Waiting"
                                   :todo "WAITING"
                                   :order 20)
                            (:name "trivial"
                                   :priority<= "C"
                                   :tag "someday"
                                   :order 90)
                            (:discard (:habit t)
                                      )))))))
          )
        )
#+end_src

*** Quick Capture

#+begin_src emacs-lisp
  (defun pgw/year-month ()
    "Custom function to return date in format: YYYY-MM"
    (format-time-string "%Y-%m"))

  (defun pgw/U ()
    "Custom function to return date in org inactive timestamp format"
    (format-time-string "[%Y-%m-%d %a]"))

  (defun pgw/add-12 ()
    "Custom function return active org timestamp with exactly 24 hour difference"
    (format-time-string "%Y-%m-%d %a %H:%M" (time-add (current-time) 85500)))

  (defun pgw/headline_date ()
    "Function to find the date as headline for Violin capture template"
    (goto-char (point-min))
    (let ((searchresults (search-forward (format-time-string "[%Y-%m-%d %a]") nil t)))
      (if searchresults
          'searchresults
        (error "Not found! Use Vc to create today's practice first.")
        )
      )
    )

  (setq org-capture-templates
        '(
  ("i" "Inbox" entry (file "~/Dropbox/org/inbox.org")
  "* TODO %?")
  ("n" "Quick Note" entry
   (file "~/Dropbox/org/inbox.org")
   "* %?
  %U")
  ("e" "Event" entry (file "~/Dropbox/org/events.org")
  "* %?
  %^t")
  ("L" "Link" entry (file+headline "~/Dropbox/org/links.org" "!Inbox")
  "* [[%?%:link][%:description]]
  :PROPERTIES:
  :CREATED: %U
  :END:" :prepend t)
  ("m" "Manual" entry (file "~/Dropbox/org/notes.org")
  "* %?
  :PROPERTIES:
  :CREATED: %U
  :END:" :empty-lines 1)
  ("b" "Book" entry (file+headline "~/Dropbox/org/notes.org" "Books")
   "* %^{RATING}p%^{Book Title}")
  ("j" "Journal" entry
  (file+olp+datetree "~/Dropbox/org/orgjournal.org.gpg")
  "* %^{RATING}p%?
  :PROPERTIES:
  :LOGGED: %^{Logged Time}U
  :END:
  " :kill-buffer t)
  ("S" "School")
  ("Se" "OE020B" entry
   (file+headline "~/Dropbox/org/school.org" "_OE020B_")
   "* TODO %?
  DEADLINE: <%<%Y-%m-%d %a 13:30>>")
  ("Sp" "OP005" entry
   (file+headline "~/Dropbox/org/school.org" "_OP005_")
   "* TODO %?
  DEADLINE: <%<%Y-%m-%d %a 14:45>>")
  ("Sd" "ODFRL" entry
   (file+headline "~/Dropbox/org/school.org" "_ODFRL_")
   "* TODO %?
  DEADLINE: <%<%Y-%m-%d %a 16:00>>")
  ("Sh" "OH011A" entry
   (file+headline "~/Dropbox/org/school.org" "_OH011A_")
   "* TODO %?
  DEADLINE: <%<%Y-%m-%d %a 08:30>>")
  ("Sm" "UM52B" entry
   (file+headline "~/Dropbox/org/school.org" "_UM52B_")
   "**** TODO %?
  DEADLINE: <%<%Y-%m-%d %a 13:30>>")
  ("M" "Music")
  ("MM" "Musicianship Homework" entry
   (file+headline "~/Dropbox/org/music.org" "Musicianship")
   "* TODO Musicianship Homework [/]
  DEADLINE: %^t
  - [ ] Written: %^{Written Homework}
  - [ ] Singing: %^{Singing}
  - [ ] Rhythm: %^{Rhythm}
  - [ ] Keyboard: %^{Keyboard}")
  ("Mc" "Conducting Homework" entry
   (file+headline "~/Dropbox/org/music.org" "Homework")
   "* TODO Conducting Homework
  DEADLINE: %^t
  - %?")
  ("V" "Violin")
  ("Vc" "Create Practice Entry" entry
   (file+olp "~/Dropbox/org/violin.org" "Practice Log")
   "* [%<%Y-%m-%d %a>]
  %t%?")
  ("Vd" "Add practice details" item
   (file+function "~/Dropbox/org/violin.org" pgw/headline_date)
   "%?")
  ))
#+end_src

*** MobileOrg

#+begin_src emacs-lisp
  ;; Set to the name of the file where new notes will be stored
  (setq org-mobile-inbox-for-pull "~/Dropbox/Apps/MobileOrg/index.org")
  ;; Set to <your Dropbox root directory>/MobileOrg.
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
#+end_src

*** Crypt

#+begin_src emacs-lisp
  (use-package org-crypt
    :load-path "elpa/org-9.2.3"
    :config
    (org-crypt-use-before-save-magic)
    (setq org-tags-exclude-from-inheritance (quote ("crypt")))

    (setq org-crypt-key "3C44F187958295E4")
    ;; GPG key to use for encryption
    ;; Either the Key ID or set to nil to use symmetric encryption.

    (setq auto-save-default nil)
    ;; Auto-saving does not cooperate with org-crypt.el: so you need
    ;; to turn it off if you plan to use org-crypt.el quite often.
    ;; Otherwise, you'll get an (annoying) message each time you
    ;; start Org.

    ;; To turn it off only locally, you can insert this:
    ;;
    ;; # -*- buffer-auto-save-file-name: nil; -*-
    )
#+end_src

*** Babel

#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)))
#+end_src

*** Org-drill

#+begin_src emacs-lisp
  ;;; org-drill
  (use-package org-drill
    :load-path "custom_load")
#+end_src

*** Latex
#+begin_src emacs-lisp
  (require 'ox-latex)
#+end_src

**** CDLatex
#+begin_src emacs-lisp
  (use-package cdlatex
    :config
    (define-key org-cdlatex-mode-map (kbd "H-d") 'cdlatex-dollar)
    (define-key cdlatex-mode-map (kbd "H-d") 'cdlatex-dollar)
    (add-hook 'org-mode-hook
              (lambda ()
                (org-cdlatex-mode)
                ))
    )
#+end_src

