init.org
**** Fragments

#+begin_src emacs-lisp
  (setq org-format-latex-options
        '(:foreground "#d6d6d4" :background default 
                      :scale 1.4
                      :html-foreground "Black" :html-background "Transparent"
                      :html-scale 1.0 
                      :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
#+end_src

Fix color handling in org-preview-latex-fragment

#+begin_src emacs-lisp
  (let ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
    (plist-put dvipng--plist :use-xcolor t)
    (plist-put dvipng--plist :image-converter '("dvipng -D %D -T tight -o %O %f")))
#+end_src

#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-c C-x C-l") 'org-toggle-latex-fragment)
#+end_src

*** Org Bullets
#+begin_src emacs-lisp
  (use-package org-bullets
      :hook (org-mode . org-bullets-mode))
#+end_src

*** Export
**** Async Init File:
#+begin_src emacs-lisp
  (setq org-export-async-init-file "~/.emacs.d/orgasyncinit.el")
#+end_src

**** Export Publishing
#+begin_src emacs-lisp
  (require 'ox-publish)
  (setq org-publish-project-alist
        '(("pages-notes"
           :base-directory "~/Dropbox/org_publish/"
           :base-extension "org"
           :publishing-directory "~/Documents/Projects/Github/github_pages/"
           :recursive t
           :publishing-function org-html-publish-to-html
           :headline-levels 4             ; Just the default for this project.
           ;; :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"css/style.css\"/>"
           :auto-preamble t
           )
          ("pages-static"
           :base-directory "~/Dropbox/org_publish/"
           :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
           :publishing-directory "~/Documents/Projects/Github/github_pages/"
           :recursive t
           :publishing-function org-publish-attachment
           )
          ("pages" :components ("pages-notes" "pages-static"))
          ))
#+end_src

*** org-noter: PDF Annotation

#+begin_src emacs-lisp
  (use-package org-noter
    :after org
    :ensure t
    :config
    (setq org-noter-default-notes-file-names '("notes.org")
          org-noter-notes-search-path '("~/Dropbox/org/notes"))
    )
#+end_src

*** TODO Diary
Use =(org-agenda-to-appt)= to add events to reminders.

*** org-gcal: Calendar Integration
Calendar Setup:
#+begin_src emacs-lisp :tangle yes
  (use-package org-gcal
    :load-path "site-lisp/org-gcal"
    :ensure t
    :demand t
    :config
    (setq org-gcal-client-id "439150530674-aab9ti8n7t80r001qmccgb2i52005f18.apps.googleusercontent.com"
          org-gcal-client-secret "5gUN_ML-yaAgdS6eg4hAZ9qo"
          org-gcal-file-alist '(("pierce.g.wang@gmail.com" .  "~/Dropbox/org/calendars/cal_gmail.org"))))
#+end_src

**** Heifetz

**** Personal

** LaTeX
#+begin_src emacs-lisp
  (setq TeX-engine 'xetex)
  (setq latex-run-command "xetex")
#+end_src

*** AUCTEX
#+begin_src emacs-lisp
  (use-package tex
    :ensure auctex
    :defer t
    :config
    (setq TeX-auto-save t))
#+end_src

*** Classes - Adding Academic XeTeX Times New Roman Class

#+begin_src emacs-lisp
  (unless (with-no-warnings (find "Times" org-latex-classes :key 'car
                                  :test 'equal))
    (add-to-list 'org-latex-classes
                 '("Times"
                   "\\documentclass[12pt]{article}
  \\usepackage{fontspec}
  \\setmainfont{Times New Roman}
  \\usepackage{hyperref}"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src

** Evil
#+begin_src emacs-lisp
  (use-package evil
    :config
    (evil-mode t)
    (add-hook 'dired-mode-hook 'evil-emacs-state)
    (add-hook 'calendar-today-visible-hook 'evil-emacs-state)
    (add-hook 'calendar-load-hook 'evil-emacs-state)
    )
#+end_src

*** Normal Mode Keybinds
#+begin_src emacs-lisp
  ;; (define-key evil-normal-state-map (kbd "<S-return>") [?m ?` ?o escape ?` ?`])
  ;; (define-key evil-normal-state-map (kbd "<s-S-return>") [?m ?` ?O escape ?` ?`])
  (define-key evil-motion-state-map (kbd "k") 'previous-line)
  (define-key evil-motion-state-map (kbd "j") 'next-line)
  (define-key evil-insert-state-map (kbd "C-a") 'beginning-of-visual-line)
  (define-key evil-insert-state-map (kbd "C-e") 'end-of-visual-line)
#+end_src

** Programming Environments
Hide-show minor mode for collapsing functions
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'hs-minor-mode)
#+end_src

*** Python
**** python-docstring
Smart Python Docstring Formatting
#+begin_src emacs-lisp
  (use-package python-docstring
    :load-path "site-lisp/python-docstring-mode")
#+end_src

**** Elpy
#+begin_src emacs-lisp
  (elpy-enable)
  (add-hook 'elpy-mode-hook
            'python-docstring-mode)
#+end_src

*** Octave
#+begin_src emacs-lisp
  (setq auto-mode-alist
        (cons '("\\.m$" . octave-mode) auto-mode-alist))
  (add-hook 'octave-mode-hook
            (lambda ()
              (abbrev-mode 1)
              (auto-fill-mode 1)
              (if (eq window-system 'x)
                  (font-lock-mode 1))))
#+end_src

