init.el

(setq org-format-latex-options
      '(:foreground "#d6d6d4" :background default 
                    :scale 1.4
                    :html-foreground "Black" :html-background "Transparent"
                    :html-scale 1.0 
                    :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))

(let ((dvipng--plist (alist-get 'dvipng org-preview-latex-process-alist)))
  (plist-put dvipng--plist :use-xcolor t)
  (plist-put dvipng--plist :image-converter '("dvipng -D %D -T tight -o %O %f")))

(use-package org-bullets
    :hook (org-mode . org-bullets-mode))

(setq org-export-async-init-file "~/.emacs.d/orgasyncinit.el")

(require 'ox-publish)
(setq org-publish-project-alist
      '(("pages-notes"
         :base-directory "~/Dropbox/org_publish/"
         :base-extension "org"
         :publishing-directory "~/Documents/Projects/Github/github_pages/"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4             ; Just the default for this project.
         ;; :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"css/style.css\"/>"
         :auto-preamble t
         )
        ("pages-static"
         :base-directory "~/Dropbox/org_publish/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
         :publishing-directory "~/Documents/Projects/Github/github_pages/"
         :recursive t
         :publishing-function org-publish-attachment
         )
        ("pages" :components ("pages-notes" "pages-static"))
        ))

(use-package org-noter
  :after org
  :ensure t
  :config
  (setq org-noter-default-notes-file-names '("notes.org")
        org-noter-notes-search-path '("~/Dropbox/org/notes"))
  )

(use-package org-gcal
  :ensure t
  :config
  (setq org-gcal-client-id "439150530674-aab9ti8n7t80r001qmccgb2i52005f18.apps.googleusercontent.com"
        org-gcal-client-secret "5gUN_ML-yaAgdS6eg4hAZ9qo"
        org-gcal-file-alist '(("pierce.g.wang@gmail.com" .  "~/Dropbox/org/calendars/cal_gmail.org"))))

(setq TeX-engine 'xetex)
(setq latex-run-command "xetex")

(use-package tex
  :ensure auctex
  :defer t
  :config
  (setq TeX-auto-save t))

(unless (with-no-warnings (find "Times" org-latex-classes :key 'car
                                :test 'equal))
  (add-to-list 'org-latex-classes
               '("Times"
                 "\\documentclass[12pt]{article}
\\usepackage{fontspec}
\\setmainfont{Times New Roman}
\\usepackage{hyperref}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(use-package evil
  :config
  (evil-mode t)
  (add-hook 'dired-mode-hook 'evil-emacs-state)
  (add-hook 'calendar-today-visible-hook 'evil-emacs-state)
  (add-hook 'calendar-load-hook 'evil-emacs-state)
  )

;; (define-key evil-normal-state-map (kbd "<S-return>") [?m ?` ?o escape ?` ?`])
;; (define-key evil-normal-state-map (kbd "<s-S-return>") [?m ?` ?O escape ?` ?`])
(define-key evil-motion-state-map (kbd "k") 'previous-line)
(define-key evil-motion-state-map (kbd "j") 'next-line)
(define-key evil-insert-state-map (kbd "C-a") 'beginning-of-visual-line)
(define-key evil-insert-state-map (kbd "C-e") 'end-of-visual-line)

(add-hook 'prog-mode-hook #'hs-minor-mode)

(use-package python-docstring
  :load-path "site-lisp/python-docstring-mode")

(elpy-enable)
(add-hook 'elpy-mode-hook
          'python-docstring-mode)

(setq auto-mode-alist
      (cons '("\\.m$" . octave-mode) auto-mode-alist))
(add-hook 'octave-mode-hook
          (lambda ()
            (abbrev-mode 1)
            (auto-fill-mode 1)
            (if (eq window-system 'x)
                (font-lock-mode 1))))
