init.org
** Macros
#+begin_src emacs-lisp
  (fset 'setupworkspace
     [?\C-c ?a ?A ?. ?\C-x ?0 ?\C-x ?3 ?\H-l ?\H-\C-x ?o ?\C-x ?2 ?\C-u ?7 ?\C-x ?^ ?\H-j ?\H-c ?i ?\H-h ?\H-c ?o ?\H-l])
  (global-set-key (kbd "C-x C-k 1") 'setupworkspace)

  ;;(fset 'OHSFigureSave
  ;;   [?# ?+ ?C ?A ?P ?T ?I ?O ?N ?: ?  ?\C-x ?Q return return tab ?\[ ?\[ ?f ?i ?l ?e ?: ?. ?/ ?W ?e ?e ?k ?  ?\C-x ?Q return ?/ ?\C-x ?Q return ?_ ?\C-u ?\M-! ?d ?a ?t ?e ?  ?+ ?% ?H ?% ?M ?% ?S return escape ?e ?a ?. ?p ?n ?g escape ?v ?B ?F ?/ ?l ?y escape ?A ?\] ?\] return escape ?p ?0 ?i ?\M-x ?i ?n ?s ?e ?r ?t ?d ?i ?r ?e ?c ?t ?o ?r ?y return escape ?V ?d ?i ?\C-x ?\C-f ?\C-  ?\C-a backspace ?/ ?U ?s ?e ?r ?s ?/ ?p ?i ?e ?r ?c ?e ?w ?a ?n ?g ?/ ?S ?c ?r ?e ?e ?n ?s ?h ?o ?t ?s return ?s ?\M-< ?\C-z ?/ ?S ?c ?r ?e ?e ?n ?  ?S ?h ?o ?t return ?R ?\C-  ?\C-a backspace ?\s-v backspace return ?\C-x ?k return])
  ;;(global-set-key (kbd "<f9>") 'OHSFigureSave)

  (defun pgw/disable-helm ()
    "Disable Helm"
    (interactive)
    (helm-mode 0))
  (defun pgw/enable-helm ()
    "Enable Helm"
    (interactive)
    (helm-mode))
  (global-set-key (kbd "H-x H-h d") 'pgw/disable-helm)
  (global-set-key (kbd "H-x H-h e") 'pgw/enable-helm)

  ;(fset 'importChineseFlashcards
  ;   [return ?\C-p ?* ?* ?  ?I ?t ?e ?m ?\C-c ?\C-c ?d ?r ?i ?l ?l return ?\C-n ?\C-a ?\C-z ?f ?= ?x ?x ?\C-z ?\C-k ?\C-n ?\C-a return return ?\C-p ?* ?* ?  ?A ?n ?s ?w ?e ?r ?\C-a ?* ?\C-n ?\C-a ?\C-y ?\; ?  ?\C-a ?\C-n ?\C-n])
  (fset 'convertQuizlet
     [?I ?* ?* ?\S-  ?I ?t ?e ?m ?  ?: ?d ?r ?i ?l ?l ?: return escape ?/ ?= ?= return ?x ?x ?i return return ?* ?* ?* ?  ?A ?n ?s ?w ?e ?r return escape ?\M-\}])
  (global-set-key (kbd "<f6>") 'convertQuizlet)

  (fset 'addqtest1
     [?\C-s ?a ?d ?d ?q ?\( return ?\C-a ?\C-  ?\C-\M-f ?\C-\M-f ?\C-f ?\C-\M-$ ?\C-q ?\C-j ?\[ ?  ?\] ?* return return ?\C-e ?\C-r ?a ?d ?d ?q ?\( return ?\C-x ?r ?  ?a ?\C-  ?\M-f ?\C-\M-f ?\C-f ?\C-x ?r ?  ?e ?\C-\M-$ ?\[ ?^ ?\\ ?\\ ?\] ?\\ ?\{ ?2 ?\\ ?\} ?' ?, ?  return ?\" ?, ?  return ?\C-x ?r ?j ?a ?\C-  ?\C-x ?r ?j ?e ?\C-\M-$ ?, ?  ?\[ ?\' ?\| ?\" ?\] return ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-e ?\C-r ?\( return ?\C-a ?\C-s ?\( return ?\C-0 ?\C-k ?\{ return ?\" ?s ?e ?r ?v ?e ?r ?\" ?  ?: ?  ?\C-s ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-u ?8 backspace ?, return ?\" ?q ?u ?e ?s ?t ?i ?o ?n ?\" ?  ?: ?  ?\" ?\C-s ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-u ?8 backspace ?, return ?\" ?a ?n ?s ?w ?e ?r ?\" ?  ?: ?  ?\" ?\C-s ?n ?i ?l ?e ?x ?i ?s ?t return ?\C-u ?8 backspace ?, return ?\" ?q ?_ ?c ?o ?m ?p ?o ?n ?e ?n ?t ?s ?\" ?  ?: ?  ?\[ ?\" ?\C-e ?\C-b ?\C-r ?, return ?\] ?\C-f ?\C-  ?\C-a ?\C-\M-$ ?n ?i ?l ?e ?x ?i ?s ?t return ?, ?  ?\" return ?\C-e ?\C-r ?, ?\C-f return ?\" ?f ?a ?i ?l ?\" ?  ?: ?\C-k ?  ?T ?r ?u ?e return ?\}])
  (global-set-key (kbd "C-x C-k 2") 'addqtest1)

  (fset 'convert_time_to_clock
     [?f ?\[ ?f ?\[ ?d ?0 ?I tab ?C ?L ?O ?C ?K ?: ?  escape ?j ?d ?0 ?i backspace ?- ?- ?\C-c ?\C-c escape ?0 ?j])
  (global-set-key (kbd "C-x C-k 3") 'convert_time_to_clock)

  (fset 'getLink
     [?\C-c ?\C-l ?\C-  ?\C-a ?\M-w return return])
  (global-set-key (kbd "C-c s-l") 'getLink)

  (fset 'journal_convert
     [?\C-  ?\M-f ?\M-f ?\M-f ?\M-w ?\M-! ?e ?c ?h ?o ?  ?\" ?* ?  ?\s-v ?\" ?  ?> ?> ?  ?j ?o ?u ?r ?n ?a ?l ?. ?o ?r ?g return ?! ?p ?a ?n ?d ?o ?c ?  ?- ?f ?  ?d ?o ?c ?x ?  ?- ?t ?  ?o ?r ?g ?  ?? ?  ?> ?> ?  ?j ?o ?u ?r ?n ?a ?l ?. ?o ?r ?g return ?g ?n])
  (global-set-key (kbd "C-x C-k 4") 'journal_convert)
#+end_src

*** Macro Query
#+begin_src emacs-lisp
  (defun my-macro-query (arg)
    "Prompt for input using minibuffer during kbd macro execution.
  With prefix argument, allows you to select what prompt string to use.
  If the input is non-empty, it is inserted at point."
    (interactive "P")
    (let* ((query (lambda () (kbd-macro-query t)))
           (prompt (if arg (read-from-minibuffer "PROMPT: ") "Input: "))
           (input (unwind-protect
                      (progn
                        (add-hook 'minibuffer-setup-hook query)
                        (read-from-minibuffer prompt))
                    (remove-hook 'minibuffer-setup-hook query))))
      (unless (string= "" input) (insert input))))
  (global-set-key "\C-xQ" 'my-macro-query)
#+end_src

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :config
    (global-set-key (kbd "C-x g") 'magit-status))
#+end_src

** yasnippet - Yet Another Snippet Extension
#+begin_src emacs-lisp
  (use-package yasnippet
    :config
    (yas-global-mode 1) ;; or M-x yas-reload-all if you've started YASnippet already.
    )
#+end_src

** Backups
#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/org/backup"))
    backup-by-copying t    ; Don't delink hardlinks
    version-control t      ; Use version numbers on backups
    delete-old-versions t  ; Automatically delete excess backups
    kept-new-versions 20   ; how many of the newest versions to keep
    kept-old-versions 5    ; and how many of the old
    )
#+end_src

** Daemon
#+begin_src emacs-lisp
  ;;(if 'server-process
  ;;    (server-start))
  (load "server")
  (unless (server-running-p) (server-start))
#+end_src

** Revert Mode
For files changed by dropbox and also dired buffers.
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src

** Calendar
#+begin_src emacs-lisp
  (setq calendar-latitude 37.550201)
  (setq calendar-longitude -121.980827)
  (setq calendar-location-name "Fremont, CA")
  (add-hook 'calendar-mode-hook
      (lambda ()
        (evil-emacs-state)
        ))
#+end_src

*** Date Style
Set date style to ISO
#+begin_src emacs-lisp
  (calendar-set-date-style 'iso)
#+end_src

** Artist Mode
#+begin_src emacs-lisp
  (add-hook 'artist-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (evil-emacs-state)
              (local-set-key (kbd "<f1>") 'artist-select-op-poly-line)
              (local-set-key (kbd "<f2>") 'artist-select-op-pen-line)
              (local-set-key (kbd "<f3>") 'artist-select-op-line)
              (local-set-key (kbd "<f4>") 'artist-select-op-square)
              (local-set-key (kbd "<f5>") 'artist-select-op-ellipse))
            )
#+end_src

** Flyspell mode
Activate =flyspell-mode= automatically in all school files.
#+begin_src elisp
  (defun pgw/turn-on-flyspell-hook ()
    (cond ((string-match "^/Users/piercewang/Google Drive/OHS/" (if (eq buffer-file-name nil) "" buffer-file-name))
           (flyspell-mode 1))))

  (add-hook 'text-mode-hook 'pgw/turn-on-flyspell-hook)
#+end_src

** Games
*** Tetris
#+begin_src emacs-lisp
  (require 'tetris)
  (define-key tetris-mode-map (kbd "z") 'tetris-rotate-prev)
  (define-key tetris-mode-map (kbd "x") 'tetris-rotate-next)
#+end_src

*** Retris
#+begin_src emacs-lisp
  (use-package retris
    :load-path "site-lisp/retris")
#+end_src

** Desktop Save
#+begin_src emacs-lisp
  (desktop-save-mode 1)
  (setq desktop-restore-frames nil)
  (setq desktop-restore-eager 5)
  (setq desktop-path (list "~/emacs/desktopsave/"))
  (setq desktop-files-not-to-save "\\(^/[^/:]*:\\|(ftp)$\\|\.gpg$\\|\.org_archive\\)")
#+end_src

** ERC
#+begin_src emacs-lisp
  (setq erc-log-channels-directory "~/logs/")
  (setq erc-save-buffer-on-part t)
  (global-set-key (kbd "H-M-e") (lambda () (interactive) (erc :server "irc.freenode.net" :port 6667 :nick "tesrodome" :password passwords_ERC)))
#+end_src

** Keybinds
#+begin_src emacs-lisp
  ;;; replace-regexp
  (global-set-key (kbd "C-M-$") 'replace-regexp)

  ;;; Open .emacs.d
  (global-set-key (kbd "H-C-M-e") (lambda () (interactive) (dired "~/.emacs.d/")))

  ;;; Regular find-file
  (global-set-key (kbd "H-C-x o") (lambda () (interactive) (switch-to-buffer "*Org Agenda*")))


  ;;; Close window
  (global-set-key (kbd "s-0") 'delete-window)
#+end_src

Insert Org-mode Image
#+begin_src emacs-lisp
  (global-set-key (kbd "<f8>") 'insert-org-image)
#+end_src

*** CANCELLED which-key
CLOSED: [2020-01-15 Wed 22:36]
#+begin_src emacs-lisp :tangle no
  (use-package which-key
    :config
    (which-key-mode)
    (setq which-key-popup-type 'side-window)
    (setq which-key-side-window-location 'bottom)
    )
#+end_src

*** Scrolling
#+begin_src emacs-lisp
  (global-set-key (kbd "C-v") (lambda () (interactive) (scroll-up-command 1)))
  (global-set-key (kbd "M-v") (lambda () (interactive) (scroll-down-command 1)))
#+end_src

** Resizing Windows
Hydra for resizing windows.

Functions to change:
(enlarge-window)
(shrink-window-horizontally)
(enlarge-window-horizontally)

#+begin_src emacs-lisp
  (defhydra hydra-windowmanage (global-map "H-c ^")
    "Hydra for window management."
    ("=" enlarge-window "+Vertical")
    ("-" (enlarge-window -1) "-Vertical")
    ("]" enlarge-window-horizontally "+Horizontal")
    ("[" shrink-window-horizontally "-Horizontal")
    ("q" nil "Quit"))

  (global-set-key (kbd "C-c C-6") 'hydra-windowmanage/body)
#+end_src

