init.el

(setq user-full-name "Pierce Wang")
(setq user-mail-address "pierce.g.wang@gmail.com")

(use-package ibuffer
  :config
  (global-set-key (kbd "C-x C-b") 'ibuffer))
(setq ibuffer-saved-filter-groups
      '(("default"
         ("emacs-config" (or (filename . "/.emacs.d/")
                             (filename . ".emacs.d/init.el")))
         ("OHS" (filename . "/Google Drive/OHS/"))
         ("Org" (filename . "/Dropbox/org/"))
         ("planner" (or
                    (name . "\*Calendar\*")
                    (name . "\*Org Agenda\*")
                    (name . "^diary$")))
         ("Helm" (name . "\*helm.*"))
         ("Magit" (mode . Magit))
         ("ERC" (mode . erc-mode))
         ("Help" (or (name . "\*Help\*")
                     (name . "\*info\*")
                     (name . "\*GNU Emacs\*"))))))

(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-switch-to-saved-filter-groups "default")))
(define-key ibuffer-mode-map (kbd "P") nil)

(setq delete-by-moving-to-trash t)
(setq trash-directory "~/.Trash")
(setq insert-directory-program "/usr/local/bin/gls"
      dired-use-ls-dired t)

(setq dired-dwim-target t)

(define-key dired-mode-map (kbd "P") nil)

(define-key dired-mode-map (kbd "O") 'pgw/dired-open-file)

(use-package dired-quick-sort
  :load-path "custom_load"
  :config
  (dired-quick-sort-setup)
  )

(setq dired-listing-switches "-alh")

(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'scroll-left 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-region 'disabled nil)

(setq browse-url-firefox-program "/Applications/Firefox.app/Contents/MacOS/firefox-bin")

;; (let ((holidays '(((9 7 2020) . "Labor Day")
;;                   ((9 11 2020) . "Back to School Night")
;;                   ((10 28 2020 10 30 2020) . "Parent-Teacher Conferences (no classes)")
;;                   ((11 25 2020 11 27 2020) . "Thanksgiving Holiday")
;;                   ((12 9 2020 12 11 2020) . "Study Days (no classes)")
;;                   ((12 14 2020 12 19 2020) . "Fall Semester Finals")
;;                   ((12 19 2020 1 3 2021) . "Winter Closure")
;;                   ((1 4 2021 1 8 2021) . "Reading Week")
;;                   ((1 18 2021) . "MLK Holiday")
;;                   ((2 15 2021) . "Presidents Day")
;;                   ((2 16 2021) . "Reading Day (No classes)")
;;                   ((3 22 2021 3 26 2021) . "Spring Break")
;;                   ((5 17 2021 5 19 2021) . "Study Days")
;;                   ((5 20 2021 5 21 2021) . "Spring Semester Finals")
;;                   ((5 24 2021 5 27 2021) . "Spring Semester Finals")
;;                   ((5 31 2021) . "Memorial Day Holiday")))
;;       (class-block '((8 19 2020 5 13 2021) . "Class Period"))
;;       (mon-on-fri '((1 22 2021) . "Monday on Friday (MLK Makeup)")))

(defun pgw/ohs-schoolyear-class-sched (date event days time)
  (let ((dayname (calendar-day-of-week date)))
    (when (and (if (equal days 1)
                   (or (memq dayname '(1 3))
                       (diary-date 2021 1 22)) ;; Monday on Friday (MLK Makeup)
                 (memq dayname '(2 4)))
               (diary-block 2020 8 19 2021 5 13)) ;; Class Period
      (when (not (or (diary-date 2020 9 7) ;; Labor Day
                     (diary-date 2020 9 11) ;; Back to School Night
                     (diary-block 2020 10 28 2020 10 30) ;; Parent-Teacher Conferences (no classes)
                     (diary-block 2020 11 25 2020 11 27) ;; Thanksgiving Holiday
                     (diary-block 2020 12 9 2020 12 11) ;; Study Days (no classes)
                     (diary-block 2020 12 14 2020 12 19) ;; Fall Semester Finals
                     (diary-block 2020 12 19 2021 1 3) ;; Winter Closure
                     (diary-block 2021 1 4 2021 1 8) ;; Reading Week
                     (diary-date 2021 1 18) ;; MLK Holiday
                     (diary-date 2021 2 15) ;; Presidents Day
                     (diary-date 2021 2 16) ;; Reading Day (No classes)
                     (diary-block 2021 3 22 2021 3 26) ;; Spring Break
                     (diary-block 2021 5 17 2021 5 19) ;; Study Days
                     (diary-block 2021 5 20 2021 5 21) ;; Spring Semester Finals
                     (diary-block 2021 5 24 2021 5 27) ;; Spring Semester Finals
                     (diary-date 2021 5 31))) ;; Memorial Day Holiday
        (format "%s %s" time event)))))

(defun pgw/turn-on-flyspell-hook ()
  (cond ((string-match "^/Users/piercewang/Google Drive/OHS/" (if (eq buffer-file-name nil) "" buffer-file-name))
         (flyspell-mode 1))))

(add-hook 'text-mode-hook 'pgw/turn-on-flyspell-hook)
